export function fetchCountries(name) {
  return fetch(`https://restcountries.com/v3.1/name/${name}?fields=name,capital,population,flags,languages`)
  .then(response => {
    if (!response.ok) {
      throw new Error(response.status);
    }
    return response.json();
  })
}



//1 fetch()--- цей метод  властивостей і методів для відправлення, отримання та обробки ресурсів від сервера ,для формування запитів на сервер
// побудованих на промісах ---url - шлях до даних на бекенді, які необхідно отримати, створити або змінити

// fetch(`https://restcountries.com/v3.1/name/${name}?fields=name,capital,population,flags,languages`)--тут через метод фетч ми даємо запит на
// сервер для отримання даних по назві а коли ставимо (?) далі ми перечислюємо fields=name обєкти які ми будемо забирати

// then(response => Код, якому потрібно зробити щось асинхронно, створює обіцянку і повертає її.він вішається коли обіцянка була виконана успішно
// тобто ми даємо якусь умову в асинхроному коді якшо умова виконається то поверне then

// Тобто ми зробили функцію fetchCountries(name) де в нейм ми водимо назву  країни чи чогось іншого що ми захочемо получити  тобто вона прішла
 // взяла дані принесла і розпарсила дані  , ця фукція виконує бере дані повертає і розпарсує приносить наші дані
// .then(response => успішне виконання промісу з колбер функцією  return response.json(); і повертаємо дані в форматі json .
// тобто ця функція що зверху поверне на обєкт даних






